
#ifndef _DEFINE_H
#define _DEFINE_H

#include <afxtempl.h>
// This is for CArray

#define _AlignmentShuttle	18.0 //mm

#define _TrayRemind			" - tray file (Product)"
#define _HandlerRemind		" - handler file (Machine)"

#define _Infinity			"Infinity"

#define _MaxLoopTestSet		50

#define _DefaultCode		"None"

#define _Tcp_If_Port		2000

#define _TimeTSRemainIC		50

#define _SendStartDelayMax	8	// secs

#define _BinDescOther		"Other"
#define _BinDescTimeout		"Timeout"

//
#define _DRecv				"R:"
#define _DSend				"S:"

//
#define _MaxPogoCount		500
#define _MaxPogoForce		45

#define _ArmLogICTray1		"Tray1"
#define _ArmLogICTray2		"Tray2"
#define _ArmLogICImage		".bmp"
#define _ArmLogICImage2		"*.bmp"
#define _ArmLogICImageJpg	".jpg"

#define _GPIBAddr			33

#define _RepeartTrayInput	"Input"			// 入料
#define _RepeartTrayOutput	"Output"		// 出料
#define _RepeartTrayBoth	"Both"			// 入料/出料
#define _RepeartTrayDisable	"Disable"		// 關閉
#define _RepeartPass		"Pass"			// 入料(放Pass)
#define _RepeartFail		"Fail"			// 出料(放Fail)

// 1.0Af
// UPH Tool
#define _UPHTs				"TsUPH"

#define _DMsgMark			" !!!!!!!!!!"

#define _ICON_Count			15
#define _ICON_Module		3	// 功能模組, 由第幾排開始排列
#define _ICON_TrayMod		4	// Tray File 相關功能, 由第幾排開始排列
#define _ICON_Handler		4	// 功能模組 Handler 主設定, 由第幾排開始排列
#define _ICON_Max			35	// 一個 page 最大功能數量
#define _ICON_Max_Row		7	// 一個 page 一列最多放幾個 Button
#define _ICON_H				8	// 一個 page Button上下距離
#define _ICON_W				8	// 一個 page Button左右距離

//

#define _Max_Error					1000
#define _Max_Language				1000
#define _Max_Event					30000

// Repeat Temper Error
#define _RepeatErrorTemp			999.0

//
#define _Max_Range_Error			2500

#if _Demo
#define _Wait						1		// ms
#else
#define _Wait						1		// ms
#endif

#define _TimeUpdate					200		// ms
#define _Status_Timer				100		// ms
#define _Tray_Status_Timer			200		// ms
#define _Interrupt_Time_Interval	50		// ms

#define _WaitD						0		// ms

#define _WaitLotDoneProgress		5		// ms

// File setting
#define _SubFileName1				"*.Tray"
#define _SubFileName2				".Tray"

#define _SubOffsetName1				"*.offset"
#define _SubOffsetName2				".offset"

#define _SubMappingName1			"*.mapping"
#define _SubMappingName2			".mapping"

#define _SubTestSettingName1		"*.set"
#define _SubTestSettingName2		".set"

// Interface Sub FileName
#define _SubInterfaceGPIB			".GPIB"
#define _SubInterfaceRS232			".RS232"
#define _SubInterfaceTCP			".TCP"
#define _SubInterfaceTTL			".TTL"

#define _SubSLTName1				"*.SLT"
#define _SubSLTName2				".SLT"

#define	_InitialZHome			2		// mm
#define	_InitialYHome			10		// mm
#define	_InitialXHome			-10		// mm
#define _InitialShuttleHome		-5		// mm
#define _InitialTestSite		10		// mm

#define _ArmRotaotr				-5.5		// mm
#define	_ArmZPlace				-1		// mm
#define _ArmZShuttle			0		// mm
#define _MaxSocketPos			-50.0	// mm


// TrayMap Using.
#define _Output_Stack_No		1		// 1 fix output
#define _Max_Tray_Map_Size		10000

// TrayMap Repeat Using
#define _Output_Stack_Number	2		// 2 fix (tray1, tray2)


#define _Site_Count				1		// 1 Site

#define _Sum1				"*.sum"
#define _Sum2				".sum"

#define _Atc1				"*.atc"
#define _Atc2				".atc"
#define _AtcDelete			".Delete"

// PreHeater 
#define _MaxPreHeaterDevice		300

//
#define _Output_Stack			1
#define _Input_Stack			1

// H/W
#define _Stack_A				4		// mm
#define _Stack_B				0		// mm

#define _PreHeater_A			10		// mm
#define _PreHeater_B			10		// mm
#define _ShuttleInput			0		// mm
#define _ShuttleOutput			0		// mm
#define _ShuttleOutputZ			-5.5	// mm
#define _TestSitePickToPlace	-1		// mm
#define _TestSitePickToHome		-15		// mm
#define _FixInputOuputZ			-5.5	// mm
#define _ArmZToCCD_X			-19		// mm
#define _ArmZToCCD_Y			2		// mm

// DB
#define _InsertCount			5
// Vision Device In, Pick Dut Position
#define		_Dut						0

#endif // _DEFINE_H

// Color Button
// Colors for the button.
const COLORREF  COLOR_RED           = RGB( 255,   0, 0   );
const COLORREF  COLOR_PINK          = RGB( 255, 192, 203 );
const COLORREF  COLOR_YELLOW        = RGB( 255, 255, 0   );
const COLORREF  COLOR_PALE_YELLOW   = RGB( 240, 230, 140 );
const COLORREF  COLOR_ORANGE        = RGB( 255, 153, 0   );
const COLORREF  COLOR_GREEN         = RGB(   0, 255, 0   );
const COLORREF  COLOR_PALE_GREEN    = RGB( 152, 251, 152 );
const COLORREF  COLOR_BLUE          = RGB(  51,  51, 255 );
const COLORREF  COLOR_WHITE         = RGB( 255, 255, 255 );

//////////////////////////////////////////////////////
// 宣告 Site Setting 結構 
// Site Setting
typedef struct tagSite{
//	bool bSiteEnable[_Site_No];
	long iRunMode;				 // the default value is on-line, we never save
	double dDemoTestTime;        // Demo Test Time
	long iSiteDummyBinForCatorgy;
	CString csSiteDummyBinForCatorgy;
} tagSite;

/////////////////////////////////////////////////////////
// 宣告 Yield Setting 結構 
// Yield Setting.
typedef struct tagYieldSetting{

	int	bYieldControlEnable;    // Yield Control Enable/Disable					 @bEnableYieldControl
	double dYieldLimit;         // Yield Limitation								 @dYieldLimit
	long iYieldWindow;          // Yield Control Quantity Condition				 @iYieldWindow			

	int	bContinueFailEnable;    // Continue Fail Enable/Disable
	long iFailCount;            // Continue Fail Counter
	long iRetestCount;          // Retest Count	

	int bDropMode;				// Yield Control Enable/Disable 
	// Note: 
	// if value == 1. 
	// It will enable Drop IC to socket. 
	// if value == 0. 
	// Test site will let IC direct contact to socket

	double dDropHigh;			// Drop Mode High
	double dDropTimer;			// Drop Mode Timer
} tagYieldSetting;

////////////////////////////////////////////////
// 宣告 Thread Count 結構 
// Thread Montior
typedef struct tagThreadCode{
	long times;					// Run Times
	long line;					// Witch stamtment
	long info;					
} tagThreadCode;

////////////////////////////////////////////////
// 宣告 ErrorParam 結構
typedef struct tagErrorMsg {
	long Code;				// 0
	CString Eng;			// 1
	CString Chi;			// 2
	CPoint p;				// 3.4
	long Level;				// 5
	bool Stop;				// 6
	bool Alarm;				// 7

	bool InitialNeed;		// 8
	CString EngProcess;		// 9
	CString ChiProcess;		// 10

	// Enable Button / Disable.
	bool BStart;			// 11
	bool BStop;				// 12
	bool BRetry;			// 13
	bool BSkip;				// 14
	bool BTrayChange;		// 15
	bool BInitial;			// 16
	bool BOneCycle;			// 17
	bool BOverride;			// 18
	bool BTestSiteSkip;		// 19
} tagErrorMsg;

////////////////////////////////////////////////
// 宣告EventLog ErrorParam 結構
typedef struct tagErrorParam {
	long Time;			//紀錄時間
	long Code;			//錯誤代碼
	long Result;		//狀態
} tagErrorParam;

////////////////////////////////////////////////
// 宣告 MotorParam 結構
typedef struct tagMotorParam{
	unsigned char	BoardID;
	unsigned char	AxisNo;
	bool			nLMT;
	bool			pLMT;
	bool			EMG;
	bool			Alarm;
	bool			InPos;
	bool			InPosReal;
	bool			ZPhase;
	bool			ZeroSpeed;
	bool			TLC;
	bool			DRV;
	bool			ERRR;
	long			RCount;
	long			LCount;
	long			Start;
	long			MaxSpeed;
	long			Accelerate;
	long			Multiple;
	long			Speed;
	long			InPosRange;
	bool			ServoOn;
	long			DrifSpeed;
	long			SearchSpeed;
	long			Jerk;
	bool			nLMTStop;
	bool			pLMTStop;
	bool			ZPhaseStop;
	bool			TLCStop;
	bool			Reverse;	// Face the motor axis, counter-clock is +
	bool			TL1;		// Torque 轉換IO(O5) 
} tagMotorParam;	

////////////////////////////////////////////////
// 宣告 Bin 結構
